Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
m     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this (deposed object 2bb31329) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_image" "this" {
      - force_remove = false -> null
      - id           = "sha256:bb903da956ab5d00b25510211ba238f9963ea614f45e8aa233edaa5aaa783098460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
      - image_id     = "sha256:bb903da956ab5d00b25510211ba238f9963ea614f45e8aa233edaa5aaa783098" -> null
      - keep_locally = false -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
      - repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:f2908091a4b1327b12daeab7d9d42674b773800b1c336784a00eeaf2c8b75898" -> null
      - triggers     = {
          - "dir_sha" = "10c463e0bc00da355d7c04fa3e806fe53541bce3"
        } -> null

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this (deposed object 81e681e7) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_image" "this" {
      - force_remove = false -> null
      - id           = "sha256:bb903da956ab5d00b25510211ba238f9963ea614f45e8aa233edaa5aaa783098460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
      - image_id     = "sha256:bb903da956ab5d00b25510211ba238f9963ea614f45e8aa233edaa5aaa783098" -> null
      - keep_locally = false -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
      - repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:f2908091a4b1327b12daeab7d9d42674b773800b1c336784a00eeaf2c8b75898" -> null
      - triggers     = {
          - "dir_sha" = "d85f7a7f980aa38a9945648dd869683ef2bce09b"
        } -> null

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:f2908091a4b1327b12daeab7d9d42674b773800b1c336784a00eeaf2c8b75898" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:f2908091a4b1327b12daeab7d9d42674b773800b1c336784a00eeaf2c8b75898" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "6711f7923b35b9f8e81e01731b88b3143987dc67" -> "fc722f329de87f5ef32b0ab1d8732e330c75050a"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this (deposed object 542162a3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:f8dd9fcb89067d7ca25ba3a0097abbed354bc318932314fd3ec25bc9ea212c16" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
      - sha256_digest        = "sha256:f2908091a4b1327b12daeab7d9d42674b773800b1c336784a00eeaf2c8b75898" -> null
      - triggers             = {
          - "dir_sha" = "d85f7a7f980aa38a9945648dd869683ef2bce09b"
        } -> null
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this (deposed object 6337b1f2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:1a3fd8663ee3f3673632c1eb4b0a783d270d1a26384ed02a8740d980646e2dc8" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
      - sha256_digest        = "sha256:f2908091a4b1327b12daeab7d9d42674b773800b1c336784a00eeaf2c8b75898" -> null
      - triggers             = {
          - "dir_sha" = "10c463e0bc00da355d7c04fa3e806fe53541bce3"
        } -> null
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this (deposed object 6b1bc411) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:ef44164a9a01fd76c5734330c3ae7af9c21c7a58a0710a4e36f873226ec86ff2" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
      - sha256_digest        = "sha256:f2908091a4b1327b12daeab7d9d42674b773800b1c336784a00eeaf2c8b75898" -> null
      - triggers             = {
          - "dir_sha" = "15dc9b9bc282ff832f3ad6ffb55228cea885fa4b"
        } -> null
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/dfb7943ee0dcd428045fc925c72f4ff0f8f31b0bd47b494de522b00229839d65.zip" -> "builds/ab37e255a2ccd6740a638703305a24b3f64ab742559c90401315a7069a04ce71.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-09-19T06:43:06.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/ab37e255a2ccd6740a638703305a24b3f64ab742559c90401315a7069a04ce71.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ab37e255a2ccd6740a638703305a24b3f64ab742559c90401315a7069a04ce71.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6301929438838172043" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/dfb7943ee0dcd428045fc925c72f4ff0f8f31b0bd47b494de522b00229839d65.zip" -> "builds/ab37e255a2ccd6740a638703305a24b3f64ab742559c90401315a7069a04ce71.zip"
          ~ "timestamp" = "1758263958264936000" -> "1758270510025285000"
        }
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] (deposed object 51c8cc81) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "499175919151756308" -> null
      - triggers = {
          - "filename"  = "builds/17ff32aa9bf57b5c9f996b78f05ce51a63a1b1cec104c63f3c98a174beb17bb2.zip"
          - "timestamp" = "1756111467134071200"
        } -> null
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] (deposed object b9fdf6c6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6122624538652511402" -> null
      - triggers = {
          - "filename"  = "builds/bef328ffafbb58749d9e45a244454eb34d7530371373dd3e6e248c982408d449.zip"
          - "timestamp" = "1758249672663785000"
        } -> null
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] (deposed object d358d706) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7081144769793277829" -> null
      - triggers = {
          - "filename"  = "builds/de823e6698d74d5e282d9a74703d54980cd3b566a4ed6f3f53c04cbf5f09c4b6.zip"
          - "timestamp" = "1758162472320482000"
        } -> null
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/fa58a01d99f45d7a953775a8a88f96d73bbafc98d2c79b28402755b6d8cfd113.zip" -> "builds/68c3d74621327a5e29ca5155343c401e8ef2c23c1760392ca6185c9ab9d9895e.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-08-25T08:50:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/68c3d74621327a5e29ca5155343c401e8ef2c23c1760392ca6185c9ab9d9895e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/68c3d74621327a5e29ca5155343c401e8ef2c23c1760392ca6185c9ab9d9895e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4314752702128812726" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7db668c8ed961912ac5ed850e32d87c74cf5cd00656f1a7f0f1dea77e9b59309.zip" -> "builds/68c3d74621327a5e29ca5155343c401e8ef2c23c1760392ca6185c9ab9d9895e.zip"
          ~ "timestamp" = "1758263957446408000" -> "1758270509253281200"
        }
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] (deposed object 9bdb66ac) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7244452706428372692" -> null
      - triggers = {
          - "filename"  = "builds/89abea36a8cf0e00358de9e170e2f251e431e6ea4679e8074697691eaca542c7.zip"
          - "timestamp" = "1758162474033735000"
        } -> null
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] (deposed object dcccd3f2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6988839606635245157" -> null
      - triggers = {
          - "filename"  = "builds/fa58a01d99f45d7a953775a8a88f96d73bbafc98d2c79b28402755b6d8cfd113.zip"
          - "timestamp" = "1756111466360932200"
        } -> null
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] (deposed object fbb2a9fe) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1207216154039653009" -> null
      - triggers = {
          - "filename"  = "builds/739a5fbb8e209bb90d2ad2918e2de3d4dc65f3330cfc1ee09621aab5029b2398.zip"
          - "timestamp" = "1758249673652764000"
        } -> null
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3457869277228041312" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957552721000" -> "1758270509469657000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (deposed object c250a319) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "9069470021240311737" -> null
      - triggers = {
          - "filename"  = "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip"
          - "timestamp" = "1758249672541502000"
        } -> null
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (deposed object f769335c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4019411715447240722" -> null
      - triggers = {
          - "filename"  = "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip"
          - "timestamp" = "1758162474945461000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3860000051746301697" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957654862000" -> "1758270509833272000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (deposed object 92d83d6c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7131124403469568457" -> null
      - triggers = {
          - "filename"  = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip"
          - "timestamp" = "1758162472629585000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (deposed object 9cedbc37) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5502623146183823786" -> null
      - triggers = {
          - "filename"  = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip"
          - "timestamp" = "1758249673183765000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (deposed object ea1856f5) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "9153888412160774790" -> null
      - triggers = {
          - "filename"  = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip"
          - "timestamp" = "1756111466727500000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/91a50397515eb9d4e91cd5f86d915ce783dea0b0f1f17733b1017df0737f6e52.zip" -> "builds/10bc5eab17cd145a6b5e9de120c5d273e97ccc28105eab53877a955b44ef6578.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-09-19T06:42:58.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/10bc5eab17cd145a6b5e9de120c5d273e97ccc28105eab53877a955b44ef6578.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/10bc5eab17cd145a6b5e9de120c5d273e97ccc28105eab53877a955b44ef6578.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1226953715290950125" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/91a50397515eb9d4e91cd5f86d915ce783dea0b0f1f17733b1017df0737f6e52.zip" -> "builds/10bc5eab17cd145a6b5e9de120c5d273e97ccc28105eab53877a955b44ef6578.zip"
          ~ "timestamp" = "1758263958637020200" -> "1758270509540711000"
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (deposed object 08e91de0) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "433563419388000959" -> null
      - triggers = {
          - "filename"  = "builds/10bc5eab17cd145a6b5e9de120c5d273e97ccc28105eab53877a955b44ef6578.zip"
          - "timestamp" = "1758249673152322000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (deposed object 4bf71ed9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1425638675701595325" -> null
      - triggers = {
          - "filename"  = "builds/3f0ca2e3ff80dc59fa3d9c8efc3a6a96ad8109a75a92dc97b77e9405f46cc15e.zip"
          - "timestamp" = "1758168312718117000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (deposed object 91238e89) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8852114330341970823" -> null
      - triggers = {
          - "filename"  = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip"
          - "timestamp" = "1756111466863931000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (deposed object 93275ccd) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3990690605240843461" -> null
      - triggers = {
          - "filename"  = "builds/3f0ca2e3ff80dc59fa3d9c8efc3a6a96ad8109a75a92dc97b77e9405f46cc15e.zip"
          - "timestamp" = "1758162473455304000"
        } -> null
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7840954091255180724" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263958230791000" -> "1758270509558266000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (deposed object b15c7816) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8478302736043651006" -> null
      - triggers = {
          - "filename"  = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
          - "timestamp" = "1758249673840722000"
        } -> null
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (deposed object cdc864f9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4695511287234543700" -> null
      - triggers = {
          - "filename"  = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
          - "timestamp" = "1756111467369546000"
        } -> null
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (deposed object e2328dab) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8397206699075853489" -> null
      - triggers = {
          - "filename"  = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
          - "timestamp" = "1758162475333116000"
        } -> null
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3745601961437141324" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263959780917800" -> "1758270508964339000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (deposed object 34d91854) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5367994362180388986" -> null
      - triggers = {
          - "filename"  = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
          - "timestamp" = "1758162472458920000"
        } -> null
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (deposed object 4d368998) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "9129474084643091827" -> null
      - triggers = {
          - "filename"  = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
          - "timestamp" = "1758249672739752000"
        } -> null
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (deposed object 92766352) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "9210519233497162754" -> null
      - triggers = {
          - "filename"  = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
          - "timestamp" = "1756111467767656000"
        } -> null
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8124893673257027631" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263958263277000" -> "1758270508475393000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (deposed object 48802bf4) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "266926870119359430" -> null
      - triggers = {
          - "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          - "timestamp" = "1758162471581040000"
        } -> null
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (deposed object a6a8bb52) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "279420487806570984" -> null
      - triggers = {
          - "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          - "timestamp" = "1758249673243649000"
        } -> null
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (deposed object f48254af) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "798892279029106317" -> null
      - triggers = {
          - "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          - "timestamp" = "1756111467139458800"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/632488536b796872d1863707cdd11d85a1dd8af4e2f3c3ad65d230a1552cd62b.zip" -> "builds/c084b6dd6b11170da6bb662a8481e0ae630a2fa15be9c948f47a1502ef742175.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-18T04:10:21.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/c084b6dd6b11170da6bb662a8481e0ae630a2fa15be9c948f47a1502ef742175.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/c084b6dd6b11170da6bb662a8481e0ae630a2fa15be9c948f47a1502ef742175.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6679880431483011088" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ea1f3de0a10721465a14a483aadb0553174f8a9d2a50a94198d39894335b1357.zip" -> "builds/c084b6dd6b11170da6bb662a8481e0ae630a2fa15be9c948f47a1502ef742175.zip"
          ~ "timestamp" = "1758263957634103000" -> "1758270509650294000"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object 91168d04) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7695704126110082091" -> null
      - triggers = {
          - "filename"  = "builds/19039ae9583ed19cd0983db81dd4c9470a66bd4082d06488091b82fef2205c71.zip"
          - "timestamp" = "1756111467862540000"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object e8bf1859) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "419430831239356428" -> null
      - triggers = {
          - "filename"  = "builds/632488536b796872d1863707cdd11d85a1dd8af4e2f3c3ad65d230a1552cd62b.zip"
          - "timestamp" = "1758162472535298200"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object e9b231fe) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3732628887703161227" -> null
      - triggers = {
          - "filename"  = "builds/6362c9f82d7b6f6f9ff710730a6ff0cd71f65872a9d7246a03d6245c5fa5aa5e.zip"
          - "timestamp" = "1758249673347523000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1886333838600588910" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263958235565000" -> "1758270509573622000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object 9e27cad0) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7100243794917045777" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1758249673654057000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object de72d167) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6609370973958808229" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1758162472233323000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object ee1488e3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6782779297099141204" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1756111466446140000"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3920232439482986452" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263958444803000" -> "1758270509332844000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object 143f6912) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6194094341039815706" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1758162473368834000"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object 2a4b13de) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6785143689445204482" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1756111467234299800"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object 2d70139a) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4487962623229225545" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1758249673855614000"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6853692722630139496" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957351818000" -> "1758270509236372000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object 12bdc040) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1965087288960448800" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1758162472542727000"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object 2f5df225) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8126604345263468201" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1756111466851289000"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object f7a16f74) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3786238793162674639" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1758249673369207000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "340215188312476107" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957634416200" -> "1758270509330492000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object 30584acf) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8597651515416974515" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1758249672881814000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object 9d654ff2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1223406225516832511" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1758162472444405000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object d07b6153) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3581614039743005051" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1756111466070144800"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1749248652926204514" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957746288000" -> "1758270508583415000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object 451ec328) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2222007108004146220" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1758162475670545200"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object a3a35e77) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5474086431704061865" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1756111466422108000"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object f201b734) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4102207934668060961" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1758249673518092000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6116032515715717541" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263958522543000" -> "1758270508737789000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object 1d0c5131) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8681426599251965849" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1758162473143224000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object 336f6c22) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2343769833031461156" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1758249672655258000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object 397bde8f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3453720856251484229" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1756111467025538000"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3919710022468642732" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957460727000" -> "1758270510054957000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (deposed object 1b96cf57) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "256572064713164027" -> null
      - triggers = {
          - "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip"
          - "timestamp" = "1758249672720316000"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (deposed object a6ecf323) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8637098692764308353" -> null
      - triggers = {
          - "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip"
          - "timestamp" = "1758162472639720000"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (deposed object ec04f045) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2775195517508396128" -> null
      - triggers = {
          - "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip"
          - "timestamp" = "1756111467153059000"
        } -> null
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7564965452545244531" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263959184376000" -> "1758270509031560000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (deposed object 07893069) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6418485823427558169" -> null
      - triggers = {
          - "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          - "timestamp" = "1758162472545533800"
        } -> null
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (deposed object d1936cf6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3555299184969919713" -> null
      - triggers = {
          - "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          - "timestamp" = "1758249673018873000"
        } -> null
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (deposed object ead21274) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1066526251903281085" -> null
      - triggers = {
          - "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          - "timestamp" = "1756111467742392000"
        } -> null
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5522133350505379323" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263958438371800" -> "1758270509635185000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] (deposed object 14d7c22f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1027834277928431944" -> null
      - triggers = {
          - "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip"
          - "timestamp" = "1758249673325023000"
        } -> null
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] (deposed object 4b5f97e3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "915700741196699367" -> null
      - triggers = {
          - "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip"
          - "timestamp" = "1758162473963620000"
        } -> null
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] (deposed object ae3e3146) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8216712083802810948" -> null
      - triggers = {
          - "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip"
          - "timestamp" = "1756111466964541000"
        } -> null
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5990820414953744237" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957228358000" -> "1758270509137345000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (deposed object 62d36643) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6727874176547646979" -> null
      - triggers = {
          - "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip"
          - "timestamp" = "1758162472857891000"
        } -> null
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (deposed object a35ff702) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4915364255219876423" -> null
      - triggers = {
          - "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip"
          - "timestamp" = "1758249673175510800"
        } -> null
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (deposed object ef8b6178) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "463124308843956021" -> null
      - triggers = {
          - "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip"
          - "timestamp" = "1756111467762225000"
        } -> null
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_py
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.